app/views/lists/show.html.slim

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ?  [["list_id", 1]]
---
  tbody
    - @list.tasks.each do |task|