app/controllers/lists_controller.rb

INSERT INTO "lists" ("title", "status", "task_total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test to do list"], ["status", "1"], ["task_total", 0], ["created_at", "2016-04-22 02:51:56.826193"], ["updated_at", "2016-04-22 02:51:56.826193"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    @list.destroy