app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "list_id", "created_at", "updated_at", "state", "time_elapsed", "time_estimated") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "dsffdsfdsfdsfds"], ["list_id", 2], ["created_at", "2016-04-29 02:32:15.623123"], ["updated_at", "2016-04-29 02:32:15.623123"], ["state", 0], ["time_elapsed", 0], ["time_estimated", 0]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "time_estimated" = ?, "time_elapsed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["time_estimated", 1], ["time_elapsed", 1], ["updated_at", "2016-05-02 01:18:56.283543"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 17]]
UPDATE "tasks" SET "time_elapsed" = ?, "time_est" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["time_elapsed", "05.69"], ["time_est", nil], ["updated_at", "2016-05-16 01:31:51.636453"], ["id", 18]]
---
  def submit_time
    @task = Task.find(params[:id])
    @task.add_to_elapsed_time(params[:current_time])

    respond_to do |format|
      if @task.save